app/Helpers/global_helper.php

function getJadwalTranport($where = [])
{
    $db = connectdb('tb_booking_transport');
    $db->select('status, jam_keberangkatan, jam_kembali, kode_booking');
    $db->where($where);
    return $db->get()->getResult();
---
SELECT `status`, `jam_keberangkatan`, `jam_kembali`, `kode_booking`
FROM `tb_booking_transport`
WHERE `status` = 'diproses'

function selectDepartemen($id_divisi = '')
{
    $db = connectDb('ms_departemen');
    $db->select("id_dept AS id, departemen AS text");
    if ($id_divisi != '') {
        $db->where('id_divisi', $id_divisi);
    }
    $db->orderBy('departemen', 'ASC');
    return $db->get()->getResult();
---
SELECT `id_dept` AS `id`, `departemen` AS `text`
FROM `ms_departemen`
ORDER BY `departemen` ASC

function _userMenu($segmen)
{
    if (_session('role') == 'Developer') {
        if ($segmen == 'user_pengguna') {
            $menu = getData('ms_menu', ['is_aktif' => 1, 'ms_menu.id IN(1,2,3)' => null], 'sort ASC')->get()->getResult();
        } elseif ($segmen == 'sistem_manajemen') {
            $menu = getData('ms_menu', ['is_aktif' => 1, 'ms_menu.id IN(4,5,6,7,8)' => null], 'sort ASC')->get()->getResult();
---
SELECT *
FROM `ms_menu`
WHERE `is_aktif` = 1
AND `ms_menu`.`id` IN(1,2,3)
ORDER BY `sort` ASC
SELECT *
FROM `ms_menu`
WHERE `is_aktif` = 1
AND `ms_menu`.`id` IN(4,5,6,7,8)
ORDER BY `sort` ASC

function _userSubMenu($id_menu)
{
    $db = connectdb('ms_menu');
    if (session('role') == 'Developer') {
        $db->select('ms_menu_sub.*');
        $db->join('ms_menu_sub', 'id_menu = ms_menu.id');
        $db->where(['ms_menu_sub.is_aktif' => 1, 'ms_menu_sub.id_menu' => $id_menu]);
        $db->orderBy('sort ASC');
        $menu = $db->get()->getResult();
---
SELECT `ms_menu_sub`.*
FROM `ms_menu`
JOIN `ms_menu_sub` ON `id_menu` = `ms_menu`.`id`
WHERE `ms_menu_sub`.`is_aktif` = 1
AND `ms_menu_sub`.`id_menu` = '4'
ORDER BY `sort` ASC

function selectArea()
{
    $db = connectDb('ms_area');
    $db->select("id_area AS id, area AS text");
    $db->orderBy('area', 'ASC');
    return $db->get()->getResult();
---
SELECT `id_area` AS `id`, `area` AS `text`
FROM `ms_area`
ORDER BY `area` ASC

function selectShift()
{
    $db = connectDb('ms_shift');
    $db->select("id_shift AS id, shift AS text");
    $db->orderBy('shift', 'ASC');
    return $db->get()->getResult();
---
SELECT `id_shift` AS `id`, `shift` AS `text`
FROM `ms_shift`
ORDER BY `shift` ASC