app/Controllers/Fotocopy.php

    public function transaksi_fotokopi()
    {
        $data['departemen'] = selectDepartemen();
        $start_date = _getVar($this->request->getVar('start_date'));
        $end_date   = _getVar($this->request->getVar('end_date'));
        $filter_kebutuhan_transaksi = _getVar($this->request->getVar('kebutuhan_transaksi'));
        $data['shift']      = selectShift();
        $data['area']       = selectArea();
        $data['start_date'] = $start_date == "" ? date('Y-m-') . '01' : $start_date;
        $data['end_date'] = $end_date == "" ? date('Y-m-t') : $end_date;
        $data['transaksi'] = getData('tb_transaksi_fotokopi', ['tanggal BETWEEN "' . $data['start_date'] . '" AND "' . $data['end_date'] . '"' => null])->get()->getResult();
---
SELECT *
FROM `tb_transaksi_fotokopi`
WHERE `tanggal` BETWEEN "2023-11-23" AND "2023-11-30"

    public function transaksi_save()
    {
        $json['input']  = [
            'tanggal'     => $this->_validation('tanggal', 'Tanggal', 'required|valid_date'),
        ];
        $json['select'] = [
            'id_dept'     => $this->_validation('id_dept', 'Departemen', 'required'),
            'kebutuhan_transaksi'   => $this->_validation('kebutuhan_transaksi', 'Kebutuhan Transaksi', 'required'),
            'jenis_user'            => $this->_validation('jenis_user', 'jenis_user', 'required'),
        ];
        if (_validationHasErrors(array_merge($json['input'], $json['select']))) {
            $departemen         = getData('ms_departemen', ['id_dept' => _getVar($this->request->getVar('id_dept'))])->get()->getRow();
---
SELECT *
FROM `ms_departemen`
WHERE `id_dept` = ''