app/Controllers/Home.php

    public function index()
    {
        $data['baru']           = count_status(['status' => 'baru']);
        $data['diproses']       = count_status(['status' => 'diproses']);
        $data['selesai']        = count_status(['status' => 'selesai']);
        $data['ditolak']        = count_status(['status' => 'ditolak']);
        $data['booking']        = getData('tb_booking_transport')->get()->getResult();
        $data['informasi']      = getData('tb_informasi')->get()->getResult();
        $data['daftar_menu']    = getData('tb_daftar_menu')->get()->getResult();
---
SELECT *
FROM `tb_booking_transport`
SELECT *
FROM `tb_informasi`
SELECT *
FROM `tb_daftar_menu`